espressif/esp-idf/components/soc/esp32c5/register/soc/hp_apm_reg.h
/** HP_APM_REGION14_ATTR_REG register
 *  Region access permissions configuration register
 */
#define HP_APM_REGION14_ATTR_REG (DR_REG_HP_APM_BASE + 0xb4)
/** HP_APM_REGION14_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 14 in REE0 mode.
 */
#define HP_APM_REGION14_R0_X    (BIT(0))
#define HP_APM_REGION14_R0_X_M  (HP_APM_REGION14_R0_X_V << HP_APM_REGION14_R0_X_S)
#define HP_APM_REGION14_R0_X_V  0x00000001U
#define HP_APM_REGION14_R0_X_S  0
/** HP_APM_REGION14_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 14 in REE0 mode.
 */
#define HP_APM_REGION14_R0_W    (BIT(1))
#define HP_APM_REGION14_R0_W_M  (HP_APM_REGION14_R0_W_V << HP_APM_REGION14_R0_W_S)
#define HP_APM_REGION14_R0_W_V  0x00000001U
#define HP_APM_REGION14_R0_W_S  1
/** HP_APM_REGION14_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 14 in REE0 mode.
 */
#define HP_APM_REGION14_R0_R    (BIT(2))
#define HP_APM_REGION14_R0_R_M  (HP_APM_REGION14_R0_R_V << HP_APM_REGION14_R0_R_S)
#define HP_APM_REGION14_R0_R_V  0x00000001U
#define HP_APM_REGION14_R0_R_S  2
/** HP_APM_REGION14_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 14 in REE1 mode.
 */
#define HP_APM_REGION14_R1_X    (BIT(4))
#define HP_APM_REGION14_R1_X_M  (HP_APM_REGION14_R1_X_V << HP_APM_REGION14_R1_X_S)
#define HP_APM_REGION14_R1_X_V  0x00000001U
#define HP_APM_REGION14_R1_X_S  4
/** HP_APM_REGION14_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 14 in REE1 mode.
 */
#define HP_APM_REGION14_R1_W    (BIT(5))
#define HP_APM_REGION14_R1_W_M  (HP_APM_REGION14_R1_W_V << HP_APM_REGION14_R1_W_S)
#define HP_APM_REGION14_R1_W_V  0x00000001U
#define HP_APM_REGION14_R1_W_S  5
/** HP_APM_REGION14_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 14 in REE1 mode.
 */
#define HP_APM_REGION14_R1_R    (BIT(6))
#define HP_APM_REGION14_R1_R_M  (HP_APM_REGION14_R1_R_V << HP_APM_REGION14_R1_R_S)
#define HP_APM_REGION14_R1_R_V  0x00000001U
#define HP_APM_REGION14_R1_R_S  6
/** HP_APM_REGION14_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 14 in REE2 mode.
 */
#define HP_APM_REGION14_R2_X    (BIT(8))
#define HP_APM_REGION14_R2_X_M  (HP_APM_REGION14_R2_X_V << HP_APM_REGION14_R2_X_S)
#define HP_APM_REGION14_R2_X_V  0x00000001U
#define HP_APM_REGION14_R2_X_S  8
/** HP_APM_REGION14_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 14 in REE2 mode.
 */
#define HP_APM_REGION14_R2_W    (BIT(9))
#define HP_APM_REGION14_R2_W_M  (HP_APM_REGION14_R2_W_V << HP_APM_REGION14_R2_W_S)
#define HP_APM_REGION14_R2_W_V  0x00000001U
#define HP_APM_REGION14_R2_W_S  9
/** HP_APM_REGION14_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 14 in REE2 mode.
 */
#define HP_APM_REGION14_R2_R    (BIT(10))
#define HP_APM_REGION14_R2_R_M  (HP_APM_REGION14_R2_R_V << HP_APM_REGION14_R2_R_S)
#define HP_APM_REGION14_R2_R_V  0x00000001U
#define HP_APM_REGION14_R2_R_S  10
/** HP_APM_REGION14_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 14 configuration registers
 *  (HP_APM_REGION14_ADDR_START_REG, HP_APM_REGION14_ADDR_END_REG and
 *  HP_APM_REGION14_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define HP_APM_REGION14_LOCK    (BIT(11))
#define HP_APM_REGION14_LOCK_M  (HP_APM_REGION14_LOCK_V << HP_APM_REGION14_LOCK_S)
#define HP_APM_REGION14_LOCK_V  0x00000001U
#define HP_APM_REGION14_LOCK_S  11

/** HP_APM_REGION15_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION15_ADDR_START_REG (DR_REG_HP_APM_BASE + 0xb8)
/** HP_APM_REGION15_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 15.
 */
#define HP_APM_REGION15_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_START_M  (HP_APM_REGION15_ADDR_START_V << HP_APM_REGION15_ADDR_START_S)
#define HP_APM_REGION15_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_START_S  0

/** HP_APM_REGION15_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION15_ADDR_END_REG (DR_REG_HP_APM_BASE + 0xbc)
/** HP_APM_REGION15_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of region 15.
 */
#define HP_APM_REGION15_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_END_M  (HP_APM_REGION15_ADDR_END_V << HP_APM_REGION15_ADDR_END_S)
#define HP_APM_REGION15_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_END_S  0

/** HP_APM_REGION15_ATTR_REG register
 *  Region access permissions configuration register
 */
#define HP_APM_REGION15_ATTR_REG (DR_REG_HP_APM_BASE + 0xc0)
/** HP_APM_REGION15_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 15 in REE0 mode.
 */
#define HP_APM_REGION15_R0_X    (BIT(0))
#define HP_APM_REGION15_R0_X_M  (HP_APM_REGION15_R0_X_V << HP_APM_REGION15_R0_X_S)
#define HP_APM_REGION15_R0_X_V  0x00000001U
#define HP_APM_REGION15_R0_X_S  0
/** HP_APM_REGION15_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 15 in REE0 mode.
 */
#define HP_APM_REGION15_R0_W    (BIT(1))
#define HP_APM_REGION15_R0_W_M  (HP_APM_REGION15_R0_W_V << HP_APM_REGION15_R0_W_S)
#define HP_APM_REGION15_R0_W_V  0x00000001U
#define HP_APM_REGION15_R0_W_S  1
/** HP_APM_REGION15_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 15 in REE0 mode.
 */
#define HP_APM_REGION15_R0_R    (BIT(2))
#define HP_APM_REGION15_R0_R_M  (HP_APM_REGION15_R0_R_V << HP_APM_REGION15_R0_R_S)
#define HP_APM_REGION15_R0_R_V  0x00000001U
#define HP_APM_REGION15_R0_R_S  2
/** HP_APM_REGION15_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 15 in REE1 mode.
 */
#define HP_APM_REGION15_R1_X    (BIT(4))
#define HP_APM_REGION15_R1_X_M  (HP_APM_REGION15_R1_X_V << HP_APM_REGION15_R1_X_S)
#define HP_APM_REGION15_R1_X_V  0x00000001U
#define HP_APM_REGION15_R1_X_S  4
/** HP_APM_REGION15_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 15 in REE1 mode.
 */
#define HP_APM_REGION15_R1_W    (BIT(5))
#define HP_APM_REGION15_R1_W_M  (HP_APM_REGION15_R1_W_V << HP_APM_REGION15_R1_W_S)
#define HP_APM_REGION15_R1_W_V  0x00000001U
#define HP_APM_REGION15_R1_W_S  5
/** HP_APM_REGION15_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 15 in REE1 mode.
 */
#define HP_APM_REGION15_R1_R    (BIT(6))
#define HP_APM_REGION15_R1_R_M  (HP_APM_REGION15_R1_R_V << HP_APM_REGION15_R1_R_S)
#define HP_APM_REGION15_R1_R_V  0x00000001U
#define HP_APM_REGION15_R1_R_S  6
/** HP_APM_REGION15_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 15 in REE2 mode.
 */
#define HP_APM_REGION15_R2_X    (BIT(8))
#define HP_APM_REGION15_R2_X_M  (HP_APM_REGION15_R2_X_V << HP_APM_REGION15_R2_X_S)
#define HP_APM_REGION15_R2_X_V  0x00000001U
#define HP_APM_REGION15_R2_X_S  8
/** HP_APM_REGION15_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 15 in REE2 mode.
 */
#define HP_APM_REGION15_R2_W    (BIT(9))
#define HP_APM_REGION15_R2_W_M  (HP_APM_REGION15_R2_W_V << HP_APM_REGION15_R2_W_S)
#define HP_APM_REGION15_R2_W_V  0x00000001U
#define HP_APM_REGION15_R2_W_S  9
/** HP_APM_REGION15_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 15 in REE2 mode.
 */
#define HP_APM_REGION15_R2_R    (BIT(10))
#define HP_APM_REGION15_R2_R_M  (HP_APM_REGION15_R2_R_V << HP_APM_REGION15_R2_R_S)
#define HP_APM_REGION15_R2_R_V  0x00000001U
#define HP_APM_REGION15_R2_R_S  10
/** HP_APM_REGION15_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 15 configuration registers
 *  (HP_APM_REGION15_ADDR_START_REG, HP_APM_REGION15_ADDR_END_REG and
 *  HP_APM_REGION15_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define HP_APM_REGION15_LOCK    (BIT(11))
#define HP_APM_REGION15_LOCK_M  (HP_APM_REGION15_LOCK_V << HP_APM_REGION15_LOCK_S)
#define HP_APM_REGION15_LOCK_V  0x00000001U
#define HP_APM_REGION15_LOCK_S  11

/** HP_APM_FUNC_CTRL_REG register
 *  APM access path permission management register
 */
#define HP_APM_FUNC_CTRL_REG (DR_REG_HP_APM_BASE + 0xc4)
/** HP_APM_M0_FUNC_EN : R/W; bitpos: [0]; default: 1;
 *  Configures to enable permission management for HP_APM_CTRL M0.
 */
#define HP_APM_M0_FUNC_EN    (BIT(0))
#define HP_APM_M0_FUNC_EN_M  (HP_APM_M0_FUNC_EN_V << HP_APM_M0_FUNC_EN_S)
#define HP_APM_M0_FUNC_EN_V  0x00000001U
#define HP_APM_M0_FUNC_EN_S  0
/** HP_APM_M1_FUNC_EN : R/W; bitpos: [1]; default: 1;
 *  Configures to enable permission management for HP_APM_CTRL M1.
 */
#define HP_APM_M1_FUNC_EN    (BIT(1))
#define HP_APM_M1_FUNC_EN_M  (HP_APM_M1_FUNC_EN_V << HP_APM_M1_FUNC_EN_S)
#define HP_APM_M1_FUNC_EN_V  0x00000001U
#define HP_APM_M1_FUNC_EN_S  1
/** HP_APM_M2_FUNC_EN : R/W; bitpos: [2]; default: 1;
 *  Configures to enable permission management for HP_APM_CTRL M2.
 */
#define HP_APM_M2_FUNC_EN    (BIT(2))
#define HP_APM_M2_FUNC_EN_M  (HP_APM_M2_FUNC_EN_V << HP_APM_M2_FUNC_EN_S)
#define HP_APM_M2_FUNC_EN_V  0x00000001U
#define HP_APM_M2_FUNC_EN_S  2
/** HP_APM_M3_FUNC_EN : R/W; bitpos: [3]; default: 1;
 *  Configures to enable permission management for HP_APM_CTRL M3.
 */
#define HP_APM_M3_FUNC_EN    (BIT(3))
#define HP_APM_M3_FUNC_EN_M  (HP_APM_M3_FUNC_EN_V << HP_APM_M3_FUNC_EN_S)
#define HP_APM_M3_FUNC_EN_V  0x00000001U
#define HP_APM_M3_FUNC_EN_S  3
/** HP_APM_M4_FUNC_EN : R/W; bitpos: [4]; default: 1;
 *  Configures to enable permission management for HP_APM_CTRL M4.
 */
#define HP_APM_M4_FUNC_EN    (BIT(4))
#define HP_APM_M4_FUNC_EN_M  (HP_APM_M4_FUNC_EN_V << HP_APM_M4_FUNC_EN_S)
#define HP_APM_M4_FUNC_EN_V  0x00000001U
#define HP_APM_M4_FUNC_EN_S  4

/** HP_APM_M0_STATUS_REG register
 *  HP_APM_CTRL M0 status register
 */
#define HP_APM_M0_STATUS_REG (DR_REG_HP_APM_BASE + 0xc8)
/** HP_APM_M0_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents permission restrictions
 *  bit1: 1 represents address out of bounds
 */
#define HP_APM_M0_EXCEPTION_STATUS    0x00000003U
#define HP_APM_M0_EXCEPTION_STATUS_M  (HP_APM_M0_EXCEPTION_STATUS_V << HP_APM_M0_EXCEPTION_STATUS_S)
#define HP_APM_M0_EXCEPTION_STATUS_V  0x00000003U
#define HP_APM_M0_EXCEPTION_STATUS_S  0

/** HP_APM_M0_STATUS_CLR_REG register
 *  HP_APM_CTRL M0 status clear register
 */
#define HP_APM_M0_STATUS_CLR_REG (DR_REG_HP_APM_BASE + 0xcc)
/** HP_APM_M0_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define HP_APM_M0_EXCEPTION_STATUS_CLR    (BIT(0))
#define HP_APM_M0_EXCEPTION_STATUS_CLR_M  (HP_APM_M0_EXCEPTION_STATUS_CLR_V << HP_APM_M0_EXCEPTION_STATUS_CLR_S)
#define HP_APM_M0_EXCEPTION_STATUS_CLR_V  0x00000001U
#define HP_APM_M0_EXCEPTION_STATUS_CLR_S  0

/** HP_APM_M0_EXCEPTION_INFO0_REG register
 *  HP_APM_CTRL M0 exception information register
 */
#define HP_APM_M0_EXCEPTION_INFO0_REG (DR_REG_HP_APM_BASE + 0xd0)
/** HP_APM_M0_EXCEPTION_REGION : RO; bitpos: [15:0]; default: 0;
 *  Represents the region where an exception occurs.
 */
#define HP_APM_M0_EXCEPTION_REGION    0x0000FFFFU
#define HP_APM_M0_EXCEPTION_REGION_M  (HP_APM_M0_EXCEPTION_REGION_V << HP_APM_M0_EXCEPTION_REGION_S)
#define HP_APM_M0_EXCEPTION_REGION_V  0x0000FFFFU
#define HP_APM_M0_EXCEPTION_REGION_S  0
/** HP_APM_M0_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents the master's security mode when an exception occurs.
 */
#define HP_APM_M0_EXCEPTION_MODE    0x00000003U
#define HP_APM_M0_EXCEPTION_MODE_M  (HP_APM_M0_EXCEPTION_MODE_V << HP_APM_M0_EXCEPTION_MODE_S)
#define HP_APM_M0_EXCEPTION_MODE_V  0x00000003U
#define HP_APM_M0_EXCEPTION_MODE_S  16
/** HP_APM_M0_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents master ID when an exception occurs.
 */
#define HP_APM_M0_EXCEPTION_ID    0x0000001FU
#define HP_APM_M0_EXCEPTION_ID_M  (HP_APM_M0_EXCEPTION_ID_V << HP_APM_M0_EXCEPTION_ID_S)
#define HP_APM_M0_EXCEPTION_ID_V  0x0000001FU
#define HP_APM_M0_EXCEPTION_ID_S  18

